Задача. Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.

var a = ['a', 'b', 'c'], b = [1, 2, 3];
var result = a.concat(b);
document.write(result);		//a,b,c,1,2,3

var result = b.concat(a);
document.write(result);		//[1, 2, 3, 'a', 'b', 'c']
----------------------------------------------
Задача. Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.

var a = ['a', 'b', 'c'];
a.push(1, 2, 3);
document.write(a);		//a,b,c,1,2,3
-----------------------------------------------
Задача. Решите эту задачу с помощью многомерных массивов. 
Переменная lang может принимать два значения: 'ru' и 'en'. 
Переменная month может принимать значения от 0 до 11.

Если lang имеет значение 'ru', то выведем название месяца, 
соответствующего содержимому переменной month, на русском языке, 
а если имеет значение 'en' – то на английском.

var lang = 'ro', month = 1;
var monthes = {
  'ru':['ianvari', 'fevrali', 'mart', 'apreli', 'avgust'],
  'ro':['ianuarie', 'februarie', 'martie', 'aprilie', 'august']
}
document.write(monthes[lang][month]);		//februarie
----------------------------------------------- concat
1.	Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.

var a = [1, 2, 3], b = [4, 5, 6];
var result = a.concat(b);
document.write(result);		//1,2,3,4,5,6
----------------------------------------------- reverse
2.	Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

var a = [1, 2, 3];
a.reverse();
document.write(a);		//3,2,1
------------------------------------------------ push, unshift
3.	Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.

var a = [1, 2, 3];
a.push(4, 5, 6);
document.write(a);		//1,2,3,4,5,6

4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
var a = [1, 2, 3];
a.unshift(4, 5, 6);
document.write(a);		//4,5,6,1,2,3
------------------------------------------------ shift, pop
5.	Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент. 

var a = ['js', 'css', 'jq'];
document.write(a.shift());		//js - primul element

var a = ['js', 'css', 'jq'];
document.write(a.pop());		//jq - ultimul element
------------------------------------------------- slice
7.	Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].

var arr = [1, 2, 3, 4, 5];
var result = arr.slice(0, 3);
document.write(result);		//1,2,3

8. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5].

var arr = [1, 2, 3, 4, 5];
var result = arr.slice(3, 5);
document.write(result);		//4,5
------------------------------------------------ splice
9.	Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].

var arr = [1, 2, 3, 4, 5];
arr.splice(1, 2);
document.write(arr);		//1,4,5

10. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4]. 

var arr = [1, 2, 3, 4, 5];
var newArr = arr.splice(1, 3);
document.write(newArr);		//2,3,4

11. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5]. 

var arr = [1, 2, 3, 4, 5];
arr.splice(3, 0, 'a', 'b', 'c');
document.write(arr);		//1,2,3,a,b,c,4,5

12. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].

var arr = [1, 2, 3, 4, 5];
arr.splice(1, 0, 'a', 'b');
arr.splice(6, 0, 'c');
arr.splice(8, 0, 'e')
document.write(arr);		//1,a,b,2,3,4,c,5,e
------------------------------------------------ sort
13.	Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.

var arr = [3, 4, 1, 2, 7];
arr.sort()
document.write(arr);	//1,2,3,4,7
------------------------------------------------ Object.keys
14.	Дан объект {js:'test', jq: 'hello', css: 'world'}. Получите массив его ключей.

var obj = {js:'test', jq: 'hello', css: 'world'};
var arrKey = Object.keys(obj);
document.write(arrKey);		//js,jq,css