1. Выведите с помощью цикла столбец чисел от 1 до 100.

function genNum(num)
{
  for (i = 0; i <= num; i++)
  {
    document.write(i + '<br>');
  }
}
genNum(100);
// 1 2 3 4 5 ... 99 100
----------------------------------------------------
2. Выведите с помощью цикла столбец чисел от 100 до 1.

function genReversNum(num)
{
  for (i = num; i >= 0; i--)
  {
    document.write(i + '<br>');
  }
}
genReversNum(100); 
//100 99 98 ... 3 2 1 0
-----------------------------------------------------
3. Выведите с помощью цикла столбец четных чисел от 1 до 100.

function parNum(num)
{
  for (i = 1; i <= num; i++)
  {
    if (i % 2 ==0)
    {
      document.write(i + '<br>');
    }
  }
}
parNum(100);
//2 4 6 8 10 ... 98 100
-----------------------------------------------------
4. Заполните массив 10-ю иксами с помощью цикла.

function addX(num)
{
  var arr = [];
  for (i = 0; i < num; i++)
  {
    arr.push('x');
  }
  document.write(arr);
}
addX(10);
//x,x,x,x,x,x,x,x,x,x
------------------------------------------------------
5. Заполните массив числами от 1 до 10 с помощью цикла.

function addNum(num)
{
  var arr = [];
  for (i = 1; i <= num; i++)
  {
    arr.push(i);
  }
  document.write(arr);
}
addNum(10); 
//1,2,3,4,5,6,7,8,9,10
------------------------------------------------------
6. Заполните массив 10-ю случайными числами (дробями) от 0 до 1 с помощью цикла. 
Дроби округляйте до двух знаков в дробной части.

function genRandom(num)
{
  var arr = [];
  for (i = 0; i <= num; i++)
  {
    arr.push(Math.random(0, 1).toFixed(2));
  }
  document.write(arr);
}
genRandom(10);
//0.62,0.83,0.32,0.08,0.50,0.67,0.40,0.33,0.42,0.17,0.53
-----------------------------------------------------
7. Заполните массив 10-ю случайными числами от 1 до 10 с помощью цикла.

function genRandom(num)
{
  var arr = [];
  for (i = 0; i <= num; i++)
  {
    arr.push((Math.random(1, 10)*10).toFixed(0));
  }
  document.write(arr);
}
genRandom(10);
//6,3,7,2,2,3,4,10,7,3,2
-----------------------------------------------------
8. Дан массив с числами. С помощью цикла выведите только те элементы массива, 
которые больше нуля и меньше 10-ти.

var arr = [12, 4, -3, 11, 7, 10, -12, 9];
for (i = 0; i < arr.length; i++)
{
  if (arr[i] > 0 && arr[i] < 10)
  {
    document.write(arr[i] + ','); 
  }
}
//4,7,9,
-----------------------------------------------------
9. Дан массив с числами. С помощью цикла проверьте, что в нем есть элемент со значением 5. 
Как только будет найден первый такой элемент - выведите 'Есть' и оборвите цикл. 
Если такого элемента нет - ничего не выводите.

var arr = [12, 4, -3, 11, 5, 7, 10, -12, 5, 9];
  for (i = 0; i < arr.length; i++)
  {
    if (arr[i] == 5)
    {
      document.write('Есть');
      break;
    }
  }   
//Есть
------------------------------------------------------
10. Дан массив. С помощью цикла выведите только те элементы массива, 
которые стоят на четных позициях (имеют четные ключи).

var arr = [12, 4, -3, 11, 5, 7, 10, -12, 5, 9];
var arrKeys = Object.keys(arr);
for (i = 0; i < arrKeys.length; i++)
{
  if (arrKeys[i] % 2 == 0)
  {
    document.write(arr[i] + ',')
  }
}
//12,-3,5,10,5,
------------------------------------------------------
11. Дан массив с числами. С помощью цикла найдите сумму элементов этого массива.

var arr = [12, 4, -3, 11, 5, 7, 10, -12, 5, 9];
var sum = 0;
for (i = 0; i < arr.length; i++)
{
  sum += arr[i];
}
document.write(sum); 
//48
--------------------------------------------------------
12. Дан массив с числами. С помощью цикла найдите сумму квадратов элементов этого массива.

var arr = [12, 4, -3, 11, 5, 7, 10, -12, 5, 9];
var newArr = [];
var sum = 0;
for (i = 0; i < arr.length; i++)
{
  newArr[i] = arr[i]*arr[i];  // or -  newArr.push(arr[i]*arr[i]);
  sum += newArr[i];
}
document.write(sum);
//714
---------------------------------------------------------
13. Дан массив с числами. Найдите среднее арифметическое его элементов 
(сумма элементов, делить на количество).

var arr = [12, 4, -3, 11, 5, 7, 10, -12, 5, 9];
var sum = 0;
for (i = 0; i < arr.length; i++)
{
  sum += arr[i];
}
document.write('Rezultat: ' + sum + ' / ' + arr.length + ' = ' + sum/arr.length); 
//Rezultat: 48 / 10 = 4.8
----------------------------------------------------------
14. Нарисуйте пирамиду с помощью document.write, как показано на рисунке, 
только у вашей пирамиды должно быть 20 рядов, а не 5:
x 
xx 
xxx 
xxxx 
xxxxx 

var str = '';
function strX(num)
{
  for (i = 0; i <= num; i++)
  {
    str += 'x';
    document.write(str + '<br>');
  }
}
strX(20);  
-----------------------------------------------------------
1
12
123
1234
12345

var str = '';
function strNum(num)
{
  for (i = 1; i <= num; i++)
  {
    str += i;
    document.write(str + '<br>');  
  }
}
strNum(9);
------------------------------------------------------------
15. Нарисуйте пирамиду с помощью document.write, как показано на рисунке, 
только у вашей пирамиды должно быть 9 рядов, а не 5:
11111 
22222 
33333 
44444 
55555 



