undefined & null - обозначает неопределенность
Значение null обозначает 'ничего'. К примеру, мы можем присвоить переменной значение null в знак того, что там ничего не лежит.
Это значение очень похоже на undefined, отличие в том, что undefined - это не определенное значение, а null - определенное - ничего.
var a;
alert(a); //выведет undefined
----------
true & false - обозначают истину и ложь.
предполагают два варианта ответа - да или нет.
----------
NaN - (Not-A-Number) обозначает не число.
alert('abc'*3); //выведет NaN
----------
Infinity & -Infinity - бесконечность и минус бесконечность. 
Если мы делим на ноль положительное число, то получаем Infinity, а если отрицательное - то -Infinity.
